Terraform Plan for prod 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.digitalocean_project.shared[0]: Reading...
data.digitalocean_vpc.shared[0]: Reading...
data.digitalocean_vpc.shared[0]: Read complete after 0s [id=0ea7dd29-8305-4f4a-a7ae-78ba85edf8e7]
data.digitalocean_project.shared[0]: Read complete after 0s [id=3dea11cd-e0c0-4df1-890b-c79bdfbcdd0a]
data.digitalocean_domain.external[0]: Reading...
data.digitalocean_domain.external[0]: Read complete after 1s [id=microservices-demo.devopsbasics.systems]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_certificate.external[0] will be created
  + resource "digitalocean_certificate" "external" {
      + domains          = [
          + "microservices-demo.devopsbasics.systems",
        ]
      + id               = (known after apply)
      + name             = "prod-app-frontend-cert"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
      + uuid             = (known after apply)
    }

  # digitalocean_loadbalancer.external[0] will be created
  + resource "digitalocean_loadbalancer" "external" {
      + algorithm                        = "round_robin"
      + disable_lets_encrypt_dns_records = false
      + droplet_ids                      = (known after apply)
      + enable_backend_keepalive         = false
      + enable_proxy_protocol            = false
      + http_idle_timeout_seconds        = (known after apply)
      + id                               = (known after apply)
      + ip                               = (known after apply)
      + name                             = "prod-app-frontend-lb"
      + project_id                       = "3dea11cd-e0c0-4df1-890b-c79bdfbcdd0a"
      + redirect_http_to_https           = false
      + region                           = "nyc3"
      + size_unit                        = (known after apply)
      + status                           = (known after apply)
      + urn                              = (known after apply)
      + vpc_uuid                         = "0ea7dd29-8305-4f4a-a7ae-78ba85edf8e7"

      + forwarding_rule {
          + certificate_id   = (known after apply)
          + certificate_name = "prod-app-frontend-cert"
          + entry_port       = 443
          + entry_protocol   = "https"
          + target_port      = 80
          + target_protocol  = "http"
          + tls_passthrough  = false
        }
    }

  # digitalocean_record.external[0] will be created
  + resource "digitalocean_record" "external" {
      + domain = "microservices-demo.devopsbasics.systems"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @snegas, Env: `prod`*